Repository: BurAndBY/irun2-mirror
Catalog: project/locale/*/LC_MESSAGES/django.po
Languages: lt, ru

source: Waiting
lt: Laukiama
ru: Ожидание

source: Executing
lt: Vykdymas
ru: Выполнение

source: Done
lt: Baigta
ru: Готово

source: State
lt: Būsena
ru: Состояние

source: Created
lt: Sukūrta
ru: Создано

source: Last updated
lt: Paskutinį kartą atnaujinta
ru: Последнее обновление

source: Priority
lt: Prioritetas
ru: Приоритет

source: Description
lt: Aprašymas
ru: Описание

source: Validation
lt: Patvirtinimas
ru: Контроль

source: Challenge
lt: Iššūkis
ru: Взлом

source: Run
lt: Paleidìmas
ru: Запуск

source: Queue is empty.
lt: Eilutė tuščia.
ru: Очередь пуста.

source: Queue
lt: Eilė
ru: Очередь

# verb
source: Restart
lt: Perkrauti
ru: Перезапустить

source: Last completed jobs
lt: Paskutiniai užpildyti darbai
ru: Последние завершённые задания

source: Remember me
lt: Prisiminti mane
ru: Запомнить меня

source: Edit profile
lt: Redaguoti profilįf
ru: Редактировать профиль

source: Change password
lt: Pakeisti slaptažodį
ru: Изменить пароль

source: Change interface language
lt: Keisti sąsajos kalbą
ru: Изменить язык интерфейса

source: Save
lt: Saugoti
ru: Сохранить

source: Logout
lt: Atsijungti
ru: Выход

source: You are now logged out. Any automatic login has also been stopped.
lt: Jūs dabar atsijungėte. Bet kuris automatinis prisijungimas taip pat buvo sustabdytas.
ru: Теперь вы вышли из системы. Автоматический вход больше невозможен.

source: Didn't mean to log out?
lt: Ar nenorėjote atsijungti?
ru: Не хотели выходить?

source: Log in again.
lt: Prisijunkite dar kartą.
ru: Войдите снова.

source: Login
lt: Prisijungti
ru: Вход

source: Your account doesn't have access to this page. To proceed, please log in with an account that has access.
lt: Jūsų paskyra neturi prieigos prie šio puslapio. Norėdami tęsti, prašome prisijungti naudodami paskyrą, kuri turi prieigą.
ru: Ваша учётная запись не имеет права доступа к этой странице. Пожалуйста, войдите под другим именем, чтобы продолжить.

source: Please log in to see this page.
lt: Prašome prisijungti, jei norite pamatyti šį puslapį.
ru: Пожалуйста, войдите в систему, чтобы открыть эту страницу.

source: Your password was changed.
lt: Jūsų slaptažodis buvo pakeistas.
ru: Ваш пароль был изменён.

source: Go to the main page.
lt: Eikite į pagrindinį puslapį.
ru: Перейти на главную страницу.

source: Please enter your old password, for security's sake, and then enter your new password twice so we can verify you typed it in correctly.
lt: Prašome įvesti savo seną slaptažodį saugumui, o tada du kartus įveskite naują slaptažodį, kad galėtume patvirtinti, kad įvedėte jį teisingai.
ru: В целях безопасности, пожалуйста, введите свой старый пароль, затем введите новый пароль дважды, чтобы мы могли убедиться в правильности написания.

source: Change my password
lt: Pakeisk mano slaptažodį
ru: Изменить мой пароль

source: standard input
lt: Standartinis įėjimas
ru: стандартный ввод

source: standard output
lt: Standartinė išvestis
ru: стандартный вывод

source: no
lt: nėra
ru: нет

source: Your changes have been saved.
lt: tavo pakeitimai buvo išsaugoti.
ru: Ваши изменения сохранены.

source: Accepted for testing
lt: Priimta bandymams

source: N/A
lt: Nepasiekiamas

source: Accepted
lt: Priimta
ru: Принято

source: Compilation Error
lt: Kompiliavimo klaida
ru: Ошибка компиляции

source: Wrong Answer
lt: Atsakymas neteisingas
ru: Неправильный ответ

source: Time Limit Exceeded
lt: Laiko riba viršyta
ru: Нарушен предел времени

source: Memory Limit Exceeded
lt: Atminties riba viršyta
ru: Нарушен предел памяти

source: Idleness Limit Exceeded
lt: Idleness Limit viršytas
ru: Нарушен предел ожидания

source: Run-time Error
lt: Klaida
ru: Ошибка во время выполнения

source: Presentation Error
lt: Pristatymo klaida
ru: Ошибка представления

source: Security Violation
lt: Saugumo pažeidimas
ru: Нарушение безопасности

source: Check Failed
lt: Patikrinti nepavyko
ru: Ошибка тестирования

# about the system
source: About
lt: Apie
ru: О системе

source: %(system_full_name)s is a software designed to serve programming contests of algorithm nature and help teachers in practicals labs on algorithm basics and related courses.
lt: %(system_full_name)s yra programinė įranga, sukurta organizuoti algoritmų pobūdžio programavimo konkursus ir padėti mokytojams praktika laboratorijose apie algoritmų pagrindus ir susijusius kursus.
ru: %(system_full_name)s — это учебно-методический комплекс, предназначенный для обслуживания олимпиад по программированию, проведения практических занятий по основам алгоритмизации и смежным наукам.

source: Source code
lt: Pirminis kodas
ru: Исходный код

source: Activity
lt: Veikla

source: Submission count during the year
lt: Paraiškų skaičius per metus

source: Statistics of courses during the current term
lt: Kursų statistika šiuo metu

source: starting from
lt: pradėti nuo

source: Submission count
lt: Paraiškų skaičius

source: All solutions
lt: Visi sprendimai
ru: Все решения

source: Accepted solutions
lt: Priimtini sprendimai

source: Outcomes
lt: Rezultatai

source: Access denied
lt: Prieiga uždrausta
ru: Доступ запрещён

source: Hall of fame
lt: Šlovės salė
ru: Зал славы

source: Leaders in number of attempts
lt: Bandymų skaičiaus lyderiai
ru: Лидеры по числу попыток

source: on problem
lt: apie problemą
ru: по задаче

# main page
source: Main
lt: Pagrindinis
ru: Главная

source: Automatic testing system
lt: Automatinė testavimo sistema
ru: Система автоматического тестирования

source: Please set up a new password instead of default one.
lt: Nustatykite naują slaptažodį, o ne numatytąjį.
ru: Пожалуйста, установите новый пароль вместо пароля по умолчанию.

source: My courses
lt: Mano kursai
ru: Мои курсы

source: My contests
lt: Mano konkursai
ru: Мои соревнования

source: Contest results
lt: Konkurso rezultatai
ru: Результаты соревнований

source: News
lt: Naujienos
ru: Новости

source: Page
lt: Puslapis
ru: Страница

source: of
lt: apie
ru: из

source: All
lt: Visi
ru: Все

source: Interface language
lt: Sąsajos kalba
ru: Язык интерфейса

source: Loading
lt: Ruošiama
ru: Загрузка

source: Add
lt: Papildyti
ru: Добавить

source: Add all
lt: Pridėti visus
ru: Добавить всё

source: Remove
lt: Pašalinti
ru: Удалить

source: Remove all
lt: Pašalinti visus
ru: Удалить всё

source: %(count)d day
lt: %(count)d diena
ru: %(count)d день

source: %d day
lt: %d diena

source: %d hour
lt: %d valanda

source: %d minute
lt: %d minutę

source: %d second
lt: %d sekundė

source: Each access level includes all the previous onces.
lt: Kiekvienas prieigos lygis apima visas ankstesnes versijas.
ru: Каждый уровень доступа включает все предыдущие.

source: Problems
lt: Problemos
ru: Задачи

source: Order of problem addition is significant.
lt: Problemos pridėjimo tvarka yra didelė.
ru: Порядок добавления задач имеет значение.

source: Statements file
lt: Pareiškimų byla
ru: Файл условий

source: You can upload a single file containing statements of all problems (usually in PDF format).
lt: Galite įkelti vieną failą, kuriame yra visų problemų aprašymai (dažniausiai PDF formatu).
ru: Вы можете загрузить один файл, содержащий условия всех задач (обычно в формате PDF).

source: Users
lt: Vartotojai
ru: Пользователи

source: User
lt: Vartotojas
ru: Пользователь

source: Problem
lt: Problema
ru: Задача

source: To
lt: Iki
ru: Кому

source: Choose the room where you are to use the closest printer.
lt: Pasirinkite kambarį, kuriame norite naudoti artimiausią spausdintuvą.

source: Text is too long.
lt: Tekstas per ilgas.

source: No access
lt: Nėra leidimo
ru: Нет доступа

source: View standings
lt: Rodyti stadijas
ru: Просмотр результатов

source: View standings and problem statements
lt: Peržiūrėti įrašus ir problemų teiginius
ru: Просмотр результатов и условий задач

source: name
lt: vardas
ru: название

source: rules
lt: taisyklės

source: access for unauthorized users
lt: prieiga neleistinam vartotojui
ru: доступ для неавторизованных пользователей

source: contestant’s access to his own solutions
lt: dalyvio prieiga prie savo sprendimų
ru: доступ участника к его собственным решениям

source: maximum number of attempts per problem
lt: didžiausias bandymų skaičius vienai problemai
ru: максимальное число попыток по задаче

source: maximum solution file size (bytes)
lt: maksimalus sprendimo failo dydis (baitai)
ru: максимальный размер файла решения (в байтах)

source: start time
lt: pradžios laikass
ru: время начала

source: duration
lt: trukmė
ru: длительность

source: standings freeze time
lt: stalo įšaldymo laikas
ru: время заморозки результатов

source: If not set, there will be no freezing.
lt: Jei nenustatyta, nebus užšaldymo.
ru: Если не задано, заморозки не будет.

source: show pending runs during the freeze time
lt: parodykite laukiančius veiksmus per užšalimo laiką
ru: отображать новые попытки во время заморозки

source: unfreeze standings after the end of the contest
lt: atskleisti varžybas po varžybų pabaigos
ru: разморозить результаты по окончании соревнования

source: enable upsolving after the end of the contest
lt: pasibaigus varžyboms leisti susitvarkyti
ru: включить дорешивание по окончании соревнования

source: enable printing
lt: įgalinti spausdinimą

source: rooms (comma-separated)
lt: kambariai (atskirti kableliais)

source: Freeze time must not exceed the contest duration.
lt: Įšaldymo laikas neturi viršyti konkurso trukmės.
ru: Время заморозки не должно быть больше длительности соревнования.

source: contestant
lt: dalyvis
ru: участник

source: juror
lt: žiuri narys
ru: член жюри

source: role
lt: vaidmuo
ru: роль

source: Question
lt: Klausimas
ru: Вопрос

source: Answer
lt: Atsakymas
ru: Ответ

source: Message
lt: Žinutė
ru: Сообщение

source: subject
lt: temag
ru: тема

source: message
lt: pranešimas
ru: сообщение

source: Printing
lt: spausdinimas

source: Cancelled
lt: atšauktas

source: room
lt: patalpa

source: text
lt: tekstas

source: status
lt: statusas

source: regular expression
lt: įprasta išraiška

source: Contestant
lt: Dalyvis
ru: Участник

source: The scoreboard will be available after the start of the contest
lt: Rezultatų suvestinė bus prieinama po varžybų pradžios
ru: Таблица результатов будет доступна после начала соревнования

source: The scoreboard is hidden
lt: Rezultatų suvestinė yra paslėpta

source: Contestants
lt: Konkurso dalyviai
ru: Участники

source: Jury
lt: Vertinimo komisija
ru: Жюри

source: Questions
lt: Klausimai
ru: Вопросы

source: No questions
lt: Jokių klausimų
ru: Вопросов нет

source: The question is going to be deleted.
lt: Klausimas bus ištrintas.
ru: Вопрос будет удалён.

source: Delete
lt: Ištrinti
ru: Удалить

source: Cancel
lt: Atšaukti
ru: Отмена

source: Apply
lt: Taikyti
ru: Применить

source: Author
lt: Autorius
ru: Автор

source: Time
lt: Laikas
ru: Время

source: File
lt: Failas
ru: Файл

source: Status
lt: Statusas
ru: Статус

source: Score
lt: Įvertinimas
ru: Очки

source: Disqualify
lt: Diskvalifikuoti

source: Cancel the disqualification
lt: Atšaukti diskvalifikaciją

source: No solutions
lt: Nėra sprendimų
ru: Решений нет

source: Compilers
lt: Kompiliatoriai
ru: Компиляторы

source: Delete the contest
lt: Ištrinti konkursą
ru: Удалить соревнование

source: Are you sure you want to permanently delete the contest? This action cannot be undone.
lt: Ar tikrai norite visam laikui ištrinti konkursą? Šis veiksmas negali būti panaikintas.
ru: Вы уверены, что хотите полностью удалить это соревнование? Это действие не может быть отменено.

source: Confirm
lt: Patvirtinti
ru: Подтвердить

source: New contest
lt: Naujas konkursas
ru: Новое соревнование

source: Create
lt: Sukurti
ru: Создать

source: Contests
lt: Konkursai
ru: Соревнования

source: There are no contests available.
lt: Konkursų nėra.
ru: Нет доступных соревнований.

source: Export
lt: Eksportas

source: System
lt: Sistema

source: Edit
lt: Redaguoti
ru: Правка

# to
source: all
lt: visos
ru: всем

source: General question
lt: Bendras klausimas
ru: Общий вопрос

source: The scoreboard was frozen at
lt: Rezultatų suvestinė buvo sušaldyta ne
ru: Таблица результатов заморожена по состоянию на

source: Last success
lt: Paskutinė sėkmė
ru: Последнее принятое решение

source: Last run
lt: Paskutinis važiavimas
ru: Последнее решение

source: Penalty
lt: Bausmė
ru: Штраф

source: Sum
lt: Suma

source: The contest has not started
lt: Konkursas dar nepradėtas
ru: Соревнование не началось

source: Time left to start
lt: Laikas liko pradėti
ru: До начала

source: The contest is running
lt: Konkursas vyksta
ru: Соревнование идёт

source: The contest is over
lt: Konkursas baigėsi
ru: Соревнование окончено

source: Messages
lt: Žinutės
ru: Сообщения

source: New message
lt: Nauja žinutė
ru: Новое сообщение

source: No messages
lt: Nėra pranešimų
ru: Сообщений нет

source: The message is going to be deleted.
lt: Pranešimas bus ištrintas.
ru: Сообщение будет удалено.

source: Send
lt: Siųsti
ru: Отправить

source: Ask a question
lt: Užduok klausimą
ru: Задать вопрос

source: New printout
lt: Naujas spaudinys

source: No printouts
lt: Nr atspaudų

source: Text
lt: Tekstas

source: Printout
lt: Atspausdinti

source: Printing is only available during the contest
lt: Spausdinimas yra prieinamas tik varžybų metu

source: Room
lt: Patalpa

source: Problems will be available after the start of the contest
lt: Problemos bus pateiktos po varžybų pradžios
ru: Задачи будут доступны после начала соревнования

source: Problem statements
lt: Problemos teiginiai
ru: Условия задач

source: No problems
lt: Jokių problemų
ru: Нет задач

source: Warning
lt: Įspėjimas
ru: Внимание

source: Someone has already answered the question.
lt: Kažkas jau atsakė į klausimą.
ru: Кто-то уже ответил на вопрос.

source: Please read the answers and submit your answer again if needed.
lt: Prašome perskaityti atsakymus ir pateikti atsakymą, jei reikia.
ru: Ознакомьтесь со списком ответов и, если необходимо, отправьте ваш ответ снова.

source: There are no answers to this question
lt: Nėra atsakymų į šį klausimą
ru: Ответов на этот вопрос нет

# verb
source: Answer
lt: Atsakymas
ru: Ответить

source: Back
lt: Pabaiga
ru: Назад

source: Settings
lt: Nustatymai
ru: Настройки

source: Properties
lt: Savybės
ru: Свойства

source: Access
lt: Priėjimas

source: Limits
lt: Ribos

source: Statements
lt: Teiginiai
ru: Условия

source: Check all
lt: Viską Patikrink
ru: Отметить все

source: Uncheck all
lt: Išvalyti visus rūbus
ru: Снять пометки

source: User filters
lt: Naudotojo filtrai

source: Edit the list
lt: Redaguokite sąrašą
ru: Редактировать список

source: Filters
lt: Filtrai

source: No users are set
lt: Nė vienas vartotojas nenustatytas
ru: Пользователи не заданы

# contest
source: Standings
lt: Lentelės
ru: Результаты

source: My solutions
lt: Mano sprendimai
ru: Мои решения

source: Submit solution
lt: Pateikite sprendimą
ru: Отправить решение

source: Reset
lt: Atstatyti
ru: Сброс

source: Refresh the page every 30 seconds
lt: Atnaujinkite puslapį kas 30 sekundžių
ru: Обновлять страницу каждые 30 секунд

source: Widescreen version
lt: Plataus ekrano versija
ru: Широкоэкранная версия

source: widescreen
lt: Plačiaekranis
ru: широкоэкр.

source: Your solution has been submitted successfully.
lt: Jūsų sprendimas buvo sėkmingai pateiktas.
ru: Ваше решение отправлено успешно.

source: You are not required to wait for the judgement result: you may continue using the system and check the status of your submissions on ‘My solutions’ page anytime.
lt: Jums nereikia laukti sprendimo rezultatų: galite bet kada toliau naudotis sistema ir patikrinti savo pateiktų būsenų puslapį „Mano sprendimai“.
ru: Нет необходимости дожидаться результата тестирования: вы можете продолжить использование системы и проверять состояние ваших посылок на странице «Мои решения» в любое время.

source: Submission form will be available after the start of the contest
lt: Paraiškos forma bus prieinama po konkurso pradžios
ru: Форма отправки будет доступна после начала соревнования

source: Upsolving mode is on: your submission will not affect the final standings.
lt: Pakilimo į aukštį režimas: jūsų pateikimas neturės įtakos galutinei pozicijai.
ru: Включён режим дорешивания: ваша посылка не повлияет на итоговые результаты.

source: The question has been successfully submitted.
lt: Klausimas buvo sėkmingai pateiktas.
ru: Вопрос был успешно отправлен.

source: Your printout has been successfully added to printing queue.
lt: Jūsų spaudinys sėkmingai pridėtas prie spausdinimo eilės.

source: Year of study
lt: Studijų metai

source: Academic year
lt: Mokslo metai

source: Problem folder
lt: Problemų aplankas
ru: Папка с задачами

source: Problems to assign per student in the course
lt: Problemos, skirtos vienam studentui priskirti kursui
ru: Число задач для назначения студенту в курсе

source: Weight coefficient
lt: Svorio koeficientas
ru: Весовой коэффициент

source: Use short subgroup names, e. g. ‘1st’, ‘2 s.’, ‘EPS’.
lt: Naudokite trumpus pogrupio pavadinimus, pvz., „1“, „2 s.“, „EPS“.

source: Topic
lt: Tema
ru: Тема

source: Attempt count limit is reached.
lt: Bandymo limitų skaičius pasiekiamas.
ru: Достигнуто ограничение по числу попыток.

source: Attachment
lt: Priedas
ru: Вложение

source: You can attach an arbitrary file to your message
lt: Savo pranešimą galite pridėti savavališkai
ru: Вы можете прикрепить к сообщению произвольный файл

source: criterion label
lt: kriterijų etiketė
ru: обозначение критерия

source: student’s access to his own solutions
lt: studento prieiga prie savo sprendimų
ru: доступ студента к его собственным решениям

source: student’s access to all solutions of the course
lt: studento prieiga prie visų kurso sprendimų
ru: доступ студента ко всем решениям курса

source: enable mark sheet
lt: įjungti ženklų lapą
ru: включить ведомость успеваемости

source: Number of attempts a day per problem
lt: Bandymų skaičius per dieną kiekvienai problemai
ru: Число попыток по задаче в день

source: Group number
lt: Grupės numeris

source: No information is given to identify the course.
lt: Kursui nustatyti nėra jokios informacijos.

source: %(group)d group
lt: %(group)d grupė

source: problem folder
lt: probleminis aplankas
ru: папка с задачами

source: criteria
lt: kriterijai
ru: критерии

source: solving problems within the course
lt: problemų sprendimo būdai
ru: решение задач в рамках курса

source: mark
lt: ženklas
ru: оценка

source: passed or not passed
lt: praėjo ar ne praėjo
ru: зачёт/незачёт

source: quiz result
lt: viktorinos rezultatas

source: description
lt: aprašymas
ru: описание

source: kind
lt: malonus
ru: вид

source: weight
lt: svoris
ru: вес

source: quiz
lt: viktorina

source: student
lt: studentas
ru: студент

source: teacher
lt: mokytojas
ru: преподаватель

source: subgroup
lt: pogrupis
ru: подгруппа

source: problem
lt: problema
ru: задача

source: pass
lt: praeiti
ru: зачёт

source: no pass
lt: ne praeiti
ru: незачёт

source: absence
lt: nebuvimas
ru: отсутствие

source: attachment
lt: tvirtinimas
ru: Вложение

source: Permission denied
lt: Leidimas nesuteiktas

source: Quiz does not exist
lt: Viktorina nėra

source: Quiz is finished or no time is left. Do you want to go to home page?
lt: Viktorina baigta arba liko ne laikas. Ar norite eiti į pradinį puslapį?

source: Request is not valid
lt: Prašymas negalioja

source: Common problems
lt: Dažniausios problemos
ru: Общие задачи

source: Students
lt: Studentai
ru: Студенты

source: Teachers
lt: Mokytojai
ru: Преподаватели

source: Student
lt: Studentas
ru: Студент

source: Teacher
lt: Mokytojas
ru: Преподаватель

source: %(count)d user was added.
lt: %(count)d vartotojas buvo pridėtas.
ru: Добавлен %(count)d пользователь.

source: %(count)d user was removed.
lt: %(count)d vartotojas buvo pašalintas.
ru: Удалён %(count)d пользователь.

source: level
lt: lygis
ru: уровень

source: Assign
lt: Priskirti
ru: Назначить

source: Statement
lt: Pareiškimas
ru: Условие

source: Assignment of problems
lt: Problemų priskyrimas
ru: Назначение задач

source: Select a problem to assign
lt: Pasirinkite priskirtą problemą
ru: Выберите задачу для назначения

source: Remove extra problem
lt: Pašalinti papildomą problemą
ru: Удалить дополнительную задачу

source: Extra problems
lt: Papildomos problemos
ru: Дополнительные задачи

source: Delete course
lt: Ištrinti kursą
ru: Удалить курс

source: Are you sure you want to permanently delete the course?
lt: Ar tikrai norite ištrinti kursą visam laikui?
ru: Вы уверены, что хотите удалить этот курс?

source: This action cannot be undone.
lt: Šis veiksmas negali būti panaikintas.
ru: Это действие не может быть отменено.

source: New course
lt: Naujas kursas
ru: Новый курс

source: Courses
lt: Kursai
ru: Курсы

source: Solutions
lt: Sprendimai
ru: Решения

source: There are no courses available.
lt: Kursų nėra.
ru: Нет доступных курсов.

source: Delete criterion
lt: Ištrinti kriterijų
ru: Удалить критерий

source: Criterion is currently used in the following courses and cannot be deleted.
lt: Kriterijus šiuo metu naudojamas šiuose kursuose ir negali būti ištrintas.
ru: Критерий в настоящий момент используется в следующих курсах и не может быть удалён.

source: Criterion is not used in courses.
lt: Kriterijus kursuose nenaudojamas.
ru: Критерий не используется в курсах.

source: Criteria
lt: Kriterijai
ru: Критерии

source: edit
lt: redaguoti
ru: редактировать

source: delete
lt: ištrinti
ru: удалить

source: There are no criteria defined
lt: Nėra nustatytų kriterijų

source: New criterion
lt: Naujas kriterijus
ru: Новый критерий

source: Number of submitted solutions
lt: Pateiktų sprendimų skaičius
ru: Количество отправленных решений

source: Programming language popularity
lt: Programavimo kalbos populiarumas
ru: Популярность языков программирования

source: Latest accepted solutions
lt: Naujausi priimami sprendimai
ru: Последние принятые решения

source: ago
lt: priešf
ru: назад

source: all
lt: visos
ru: все

source: accepted
lt: priimtas
ru: принятые

source: No problem is assigned
lt: Problema nėra priskirta
ru: Задача не назначена

source: solution
lt: sprendimas
ru: решение

source: Compose
lt: Rašyti
ru: Написать

source: No subject
lt: Nėra temos
ru: Без темы

source: Public conversation
lt: Viešas pokalbis
ru: Общедоступный разговор

source: Consider the issue resolved
lt: Apsvarstykite, ar problema išspręsta
ru: Считать вопрос решённым

source: Reply to thread
lt: Atsakyti į temą
ru: Ответ в тему

source: Reply
lt: Atsakyti
ru: Ответить

source: Delete thread
lt: Ištrinti giją
ru: Удалить тему

source: Conversation will be deleted
lt: Pokalbis bus ištrintas
ru: Переписка будет удалена

source: %(counter)s message
lt: %(counter)s pranešimas
ru: %(counter)s сообщение

source: My problems
lt: Mano problemos
ru: Мои задачи

source: Course problems
lt: Kursų problemos
ru: Задачи по курсу

source: Select a topic to view problems.
lt: Pasirinkite temą, kad galėtumėte peržiūrėti problemas.
ru: Выберите тему, чтобы посмотреть задачи.

source: Problem is assigned
lt: Problema priskiriama
ru: Задача назначена

source: Problem is not assigned
lt: Problema nėra priskirta
ru: Задача не назначена

source: Solution description
lt: Sprendimo aprašymas
ru: Описание решения

source: Quiz
lt: Viktorina

source: Attention
lt: Dėmesio

source: Are you sure you want to finish this quiz?
lt: Ar tikrai norite baigti šią viktoriną?

source: Some questions left unanswered.
lt: Kai kurie klausimai liko neatsakomi.

source: Quizzes
lt: Viktorinos

source: Your browser is out-of-date.
lt: Jūsų naršyklė yra pasenusi.

source: You will not be able to pass a quiz using this browser.
lt: Jūs negalėsite perduoti viktorinos naudodami šią naršyklę.

source: %(counter)s question
lt: %(counter)s klausimas

source: unlimited number of attempts
lt: neribotas bandymų skaičius

source: %(counter)s attempt left
lt: %(counter)s bandymas paliko
