Repository: BurAndBY/irun2-mirror
Catalog: project/locale/*/LC_MESSAGES/django.po
Languages: lt, ru

source: Unable to determine the name of the source file. For Java code, make sure you have a single public class defined. You can also try to upload a file instead of using direct input of code.
lt: Negalima nustatyti šaltinio failo pavadinimo. Java kodui įsitikinkite, kad turite apibrėžtą vieną viešą klasę. Taip pat galite pabandyti įkelti failą vietoj tiesioginio kodo įvedimo.
ru: Не удаётся определить имя исходного файла. Если используется Java, убедитесь, что объявлен ровно один public-класс. Вы также можете попробовать загрузить файл вместо того, чтобы непосредственно вводить код.

source: outcome
lt: rezultatas
ru: вердикт

source: state
lt: būklė
ru: состояние

source: Preparing
lt: Rengia
ru: Подготовка

source: Compiling
lt: Kompiliavimas
ru: Компиляция

source: Testing
lt: Testavimas
ru: Тестирование

source: Finishing
lt: Užbaigimas
ru: Завершение

source: Not Done
lt: Nebaigta
ru: Не готово

source: Problem ID
lt: Problemos ID
ru: ID задачи

source: User ID
lt: Vartotojo ID
ru: ID пользователя

source: First solution
lt: Pirmasis sprendimas
ru: Первое решение

source: Second solution
lt: Antrasis sprendimas
ru: Второе решение

source: Show only contextual differences, else show full files
lt: Rodyti tik konteksto skirtumus, kitaip rodyti visus failus
ru: Показать только различия с контекстом, иначе показать полные файлы

source: Solution compilation log
lt: Sprendimų rinkimo žurnalas
ru: Журнал компиляции решения

source: no access
lt: nėra leidimo
ru: нет доступа

source: view current solution state
lt: peržiūrėkite dabartinį sprendimo būseną
ru: просмотр текущего состояния решения

source: view compilation log
lt: peržiūrėkite kompiliavimo žurnalą
ru: просмотр журнала компиляции

source: view source code
lt: peržiūrėti šaltinio kodą
ru: просмотр исходного кода

source: view testing details on sample tests
lt: peržiūrėkite testavimo duomenis apie bandinių bandymus

source: view testing details
lt: peržiūrėkite testavimo duomenis
ru: просмотр деталей тестирования

source: view testing details with checker messages
lt: peržiūrėkite testavimo duomenis su tikrinimo pranešimais
ru: просмотр деталей тестирования с сообщениями программы проверки

source: view testing details and test data
lt: peržiūrėkite testavimo duomenis ir bandymų duomenis
ru: просмотр деталей тестирования и данных тестов

source: Number of solutions
lt: Sprendimų skaičius
ru: Количество решений

source: Comparison of solutions
lt: Sprendimų palyginimas
ru: Сравнение решений

source: and
lt: ir
ru: и

source: Compare
lt: Palyginkite
ru: Сравнить

source: Unable to compare solutions.
lt: Nepavyko palyginti sprendimų.
ru: Не удаётся сравнить решения.

source: Solution
lt: Sprendimas
ru: Решение

source: The files are identical.
lt: Failai yra identiški.
ru: Файлы одинаковые.

source: Full files
lt: Pilni failai
ru: Файлы полностью

source: Differences only
lt: Tik skirtumų
ru: Только отличия

source: Are you sure you want to %(action)s these solutions?
lt: Ar tikrai norite %(action)s šiuos sprendimus?
ru: Вы уверены, что хотите %(action)s эти решения?

source: There are no solutions selected.
lt: Nėra pasirinktų sprendimų.
ru: Решения не выбраны.

source: Check failed
lt: Patikrinti nepavyko
ru: Ошибка тестирования

source: committed
lt: padaryta
ru: зафиксировано

source: rolled back
lt: grąžintas atgal
ru: отменено

source: View source code
lt: Peržiūrėti šaltinio kodą
ru: Посмотреть исходный код

source: Outcome
lt: Rezultatas
ru: Вердикт

source: Memory
lt: Atmintis
ru: Память

source: Exit Code
lt: Išeiti iš kodo
ru: Код выхода

source: Checker message
lt: Tikrintuvo pranešimas

source: Hide
lt: Slėpti
ru: Скрыть

source: No test results
lt: Nr bandymo rezultatus
ru: Нет результатов по тестам

source: Judgement
lt: Teismo sprendimas
ru: Запуск

source: of solution
lt: tirpalo
ru: решения

source: Rejudge
lt: Pakartokite
ru: Перетестирование

source: Test results
lt: Testo rezultatai
ru: Результаты тестов

source: Compilation log
lt: Kompiliavimo žurnalas
ru: Журнал компиляции

source: Runs
lt: Veikia
ru: Запуски

source: In queue
lt: Eilėje
ru: В очереди

source: Before
lt: Anksčiau
ru: До

source: After
lt: Po
ru: После

source: Current
lt: Dabartinis
ru: Текущий

source: Commit
lt: Įsipareigoti
ru: Фиксировать

source: Rollback
lt: Atmesti
ru: Откатить

source: Clone
lt: Klonas
ru: Клонировать

source: To the list of rejudges
lt: Į teisėjų sąrašą
ru: К списку перетестирований

source: Input&thinsp;/&thinsp;output
lt: Įvesties / išvesties
ru: Ввод&thinsp;/&thinsp;вывод

source: Contest
lt: Konkursas
ru: Соревнование

source: Submitted
lt: Pateikta
ru: Отправлено

source: Judged
lt: Vertinta
ru: Протестировано

source: IP address
lt: IP adresas
ru: IP-адрес

source: Judgements
lt: Sprendimai
ru: Запуски

source: Changes
lt: Pokyčiai
ru: Изменения

source: Compare the soluton with the previous one
lt: Palyginkite soluton su ankstesniu
ru: Сравнить решение с предыдущим

source: Compilation log is not available
lt: Kompiliavimo žurnalas nėra prieinamas
ru: Журнал компиляции недоступен

source: Similarity
lt: Panašumas
ru: Похожесть

source: Verdict
lt: Nuosprendis
ru: Вердикт

source: No data
lt: Nėra duomenų
ru: Нет данных

source: Select all
lt: Pasirinkti visus

source: Style
lt: Stilius

source: Standard output (stdout)
lt: Standartinė išvestis (stdout)
ru: Стандартный вывод (stdout)

source: Standard error (stderr)
lt: Standartinė klaida (stderr)
ru: Стандартный вывод ошибок (stderr)

source: Test case is not available in the current problem version.
lt: Tyrimo atvejis nėra prieinamas dabartinėje problemos versijoje.
ru: В текущей версии задачи тест недоступен.

source: error while compiling checker
lt: klaida renkant tikrintoją
ru: ошибка компиляции программы проверки

source: error while compiling validator
lt: klaida rengiant validator
ru: ошибка компиляции контролёра тестов

source: compiler is not available for the testing module
lt: kompiliatorius nėra prieinamas bandymo moduliui
ru: компилятор недоступен для модуля тестирования

# verb
source: rejudge
lt: pakartokite
ru: перетестировать

source: Enter text here
lt: Įveskite tekstą čia
ru: Введите текст здесь

source: Filename
lt: Failo pavadinimas
ru: Имя файла

source: File storage
lt: Failų saugykla
ru: Хранилище файлов

source: This is internal debug page.
lt: Tai yra vidinis derinimo puslapis.
ru: Это внутренняя отладочная страница.

source: You can get access to any resource by its id:
lt: Jūs galite gauti prieigą prie bet kurio šaltinio pagal jo id:
ru: Вы можете получить доступ к любому ресурсу по его идентификатору:

source: Upload new resource
lt: Įkelkite naują šaltinį
ru: Загрузить новый ресурс

source: Storage statistics
lt: Sandėliavimo statistika
ru: Статистика хранения

source: The file is <strong>binary</strong> and its content can not be displayed.
lt: Failas yra <strong>dvejetainis</strong>, jo turinys negali būti rodomas.
ru: Файл <strong>бинарный</strong> и его содержимое не может быть показано.

source: The file is <strong>too big</strong>, so it is displayed truncated. You can download the full version.
lt: Failas yra <strong>per didelis</strong>, todėl jis rodomas sutrumpintas. Galite atsisiųsti visą versiją.
ru: Файл <strong>слишком большой</strong>, поэтому он показан сокращённым. Вы можете загрузить полную версию.

source: The file is binary.
lt: Failas yra dvejetainis.
ru: Файл бинарный.

source: The file is too big.
lt: Failas per didelis.
ru: Файл слишком большой.

source: The encoding of the file is not UTF-8.
lt: Failo kodavimas nėra UTF-8.
ru: Файл не в кодировке UTF-8.

source: The file has Byte Order Mark (BOM).
lt: Failas turi Byte Order Mark (BOM).
ru: В файле есть метка порядка байтов (BOM).

source: New resource
lt: Naujas šaltinis
ru: Новый ресурс

source: Submit
lt: Patvirtinti
ru: Отправить

source: View resource
lt: Žiūrėti šaltinį
ru: Просмотр ресурса

source: Resource usage
lt: Išteklių naudojimas
ru: Использование ресурса

source: Size
lt: Dydis
ru: Размер

source: Is binary
lt: Yra dvejetainis
ru: Является бинарным

source: Is UTF-8
lt: Ar UTF-8
ru: В кодировке UTF-8

source: Has BOM
lt: Turi BOM
ru: Имеет BOM

source: Resource not found in the file storage.
lt: Išteklių nerasta failų saugykloje.
ru: Ресурс не найден в хранилище.

source: Resource count
lt: Išteklių skaičius
ru: Число ресурсов

source: Total size
lt: Bendras dydis
ru: Общий размер

source: The largest resources
lt: Didžiausi ištekliai
ru: Самые большие ресурсы

source: log
lt: prisijungti
ru: журнал

source: Cleanup stdout/stderr
lt: Valymas stdout/stderr
ru: Очистить stdout/stderr

source: Filename must be a string
lt: Failo pavadinimas turi būti eilutė
ru: Имя файла должно быть строкой

source: Filename cannot be empty
lt: Failo vardas negali būti tuščias
ru: Имя файла не может быть пустым

source: The use of characters in range 0–31 in filenames is forbidden
lt: Draudžiama naudoti simbolius nuo 0 iki 31 failų pavadinimuose
ru: Использование символов с кодами 0–31 в именах файлов запрещено

source: Characters %(forbidden)s are reserved and cannot be used in filenames
lt: Simboliai %(forbidden)s yra rezervuoti ir negali būti naudojami failų pavadinimuose
ru: Символы %(forbidden)s зарезервированы и не могут быть использованы в именах файлов

source: For compatibility with Windows, words CON, PRN, AUX, NUL, COM1…9, LPT1…9 are reserved and cannot be used as filenames
lt: Suderinamumui su Windows žodžiai CON, PRN, AUX, NUL, COM1...9, LPT1...9 yra rezervuoti ir negali būti naudojami kaip failų pavadinimai
ru: Для совместимости с Windows слова CON, PRN, AUX, NUL, COM1…9, LPT1…9 зарезервированы и не могут быть именами файлов

source: Filename must not end with a space or a period
lt: Failo pavadinimas neturi baigtis erdve ar laikotarpiu
ru: Имя файла не должно заканчиваться на пробел или точку

source: %(rows)s DB row updated
lt: %(rows)s DB eilutė atnaujinta
ru: Обновлена %(rows)s строка в БД

source: DMA department of FAMCS BSU
lt: DMA FAMCS BSU skyrius
ru: Кафедра ДМА ФПМИ БГУ

source: Feedback
lt: Atsiliepimai
ru: Обратная связь

source: Administration
lt: Administravimas
ru: Администрирование

source: View Feedback
lt: Peržiūrėti atsiliepimą
ru: Просмотр сообщений обратной связи

source: Folder name
lt: Aplanko pavadinimas
ru: Имя папки

source: Students: “[username] [last name] [first name]” or “[username] [last name] [first name] [patronymic]”
lt: Studentai: „[vartotojo vardas] [pavardė] [vardas]“ arba „[vartotojo vardas] [pavardė] [vardas] [tėvo vardas]“
ru: Студенты: «[имя пользователя] [фамилия] [имя]» или «[имя пользователя] [фамилия] [имя] [отчество]»

source: Teams: “[username] [team name]”
lt: Komandos: „[username] [team name]“
ru: Команды: «[имя пользователя] [название команды]»

source: Mode
lt: Būsena
ru: Режим

source: Data about users
lt: Duomenys apie naudotojus
ru: Данные о пользователях

source: Enter lines in the given format.
lt: Įveskite eilučių nurodytu formatu.
ru: Введите строки в указанном формате.

source: Password
lt: Slaptažodis
ru: Пароль

source: Line %(number)s does not match the template.
lt: Eilutė %(number)s neatitinka šablono.
ru: Строка %(number)s не соответствует шаблону.

source: User “%(username)s” is listed more than once.
lt: Naudotojas „%(username)s“ yra išvardytas daugiau nei vieną kartą.
ru: Пользователь «%(username)s» указан несколько раз.

source: Team name
lt: Komandos pavadinimas

source: Team members
lt: Komandos nariai

source: Last name, first name, patronymic
lt: Pavardė, vardas, tėvavardis

source: Field to update
lt: Laukas atnaujinti

source: Enter lines in the format of “[username] [value]”.
lt: Įveskite eilutes „[username] [value]“ formatu.

source: User “%(username)s” does not exist.
lt: Naudotojas „%(username)s“ neegzistuoja.
ru: Пользователь «%(username)s» не существует.

source: Archive should not contain subdirectories.
lt: Archyvas neturėtų turėti pakatalogių.

source: File extension %(ext)s is not supported.
lt: Failo plėtinys %(ext)s nepalaikomas.

source: User %(username)s is not found.
lt: Vartotojas %(username)s nerasta.

source: Destination folder
lt: Paskirties aplanką
ru: Папка назначения

source: Staff only
lt: Tik personalui
ru: Только сотрудники

source: User will see a warning message until he sets a new password. This prevents usage of insecure default passwords.
lt: Vartotojas pamatys įspėjimo pranešimą, kol jis nustatys naują slaptažodį. Tai neleidžia naudoti nesaugių numatytųjų slaptažodžių.
ru: Пользователь будет видеть предупреждение, пока не установит новый пароль. Таким образом предотвращается использование небезопасных паролей по умолчанию.

source: For service accounts used by the testing module.
lt: Paslaugų paskyroms, naudojamoms bandymo modulyje.
ru: Для служебных учётных записей, которые используются модулем тестирования.

source: Photo
lt: Nuotrauka

source: Select JPEG image.
lt: Pasirinkite JPEG vaizdą.

source: Person
lt: Asmuo

source: Team
lt: Komanda

source: folder
lt: aplanke
ru: папка

source: patronymic
lt: tėvo vardas
ru: отчество

source: password needs to be changed by user
lt: slaptažodis turi būti pakeistas vartotojo
ru: пользователю необходимо изменить пароль

source: last used compiler
lt: paskutinis naudojamas kompiliatorius
ru: последний использованный компилятор

source: API access
lt: API prieiga
ru: Доступ к API

source: members
lt: nariai

source: The image cannot be opened and identified.
lt: Vaizdas negali būti atidarytas ir identifikuotas.

source: The image format %(format)s is not supported.
lt: Vaizdo formatas %(format) s nepalaikomas.

source: No users selected
lt: Nerasta jokių naudotojų
ru: Пользователи не выбраны

source: New user
lt: Naujas vartotojas
ru: Новый пользователь

source: Sign-up
lt: Užsiregistruoti
ru: Регистрация

# noun
source: Update profiles
lt: Atnaujinkite profilius

source: Upload photo
lt: Įkelti nuotrauką

source: Move
lt: Perkelti
ru: Переместить

source: Swap first and last name
lt: Pakeiskite vardą ir pavardę
ru: Поменять местами имя и фамилию

source: Export as JSON
lt: Eksportuoti kaip JSON

source: There are no users in the folder
lt: Šiame aplanke nėra naudotojų
ru: В этой папке нет пользователей

source: User search
lt: Vartotojų paieška
ru: Поиск пользователей

source: No users found.
lt: Nerasta jokių naudotojų.
ru: Пользователи не найдены.

source: Username
lt: Vartotojo vardas
ru: Имя пользователя

# human
source: Full name
lt: Pilnas vardas
ru: Полное имя

source: Last login
lt: Paskutinis prisijungimas
ru: Последний вход

source: Update profile
lt: Atnaujinti aprašymą
ru: Обновить профиль

source: Raw passwords are not stored, so there is no way to see this user's password, but you can set a new password.
lt: Neapdoroti slaptažodžiai nėra saugomi, todėl nėra galimybės matyti šio vartotojo slaptažodžio, tačiau galite nustatyti naują slaptažodį.
ru: Пароли не хранятся в открытом виде, поэтому нет возможности увидеть пароль этого пользователя. Но вы можете установить новый пароль.

source: The user belongs to staff and has extended access permissions.
lt: Vartotojas priklauso darbuotojams ir turi išplėstas prieigos teises.
ru: Пользователь входит в число сотрудников и обладает расширенными правами.

source: First name
lt: Vardas
ru: Имя

source: Patronymic
lt: Tėvo vardas
ru: Отчество

source: Last name
lt: Pavardė
ru: Фамилия

source: Email address
lt: Elektroninio pašto adresas
ru: Адрес электронной почты

source: Date joined
lt: Data prisijungta
ru: Дата регистрации

source: Prompt to change password
lt: Prašau pakeisti slaptažodį
ru: Предложить изменить пароль

source: Permissions
lt: Leidimai
ru: Права доступа

source: Create user
lt: Sukurti vartotoją
ru: Создать пользователя

source: Bulk sign-up
lt: Masinis prisiregistravimas
ru: Массовая регистрация

source: Bulk profile update
lt: Didžioji profilio atnaujinimas

source: %(count)d profile has been updated.
lt: %(count)d profilis atnaujintas.

source: Bulk photo upload
lt: Masinis nuotraukų įkėlimas

source: %(count)d photo has been uploaded.
lt: %(count)d nuotrauka buvo įkelta.

source: Are you sure you want to delete the users?
lt: Ar tikrai norite ištrinti naudotojus?
ru: Вы уверены, что хотите удалить этих пользователей?

source: Are you sure you want to move the users to another folder?
lt: Ar tikrai norite perkelti naudotojus į kitą aplanką?
ru: Вы уверены, что хотите переместить пользователей в другую папку?

source: Are you sure you want to swap first and last name of these users?
lt: Ar tikrai norite pakeisti šių vartotojų vardą ir pavardę?
ru: Вы уверены, что хотите поменять местами имя и фамилию у этих пользователей?

source: s
ru: с

source: Autorefresh
ru: Автообновление

source: Use short subgroup names, e. g. &laquo;1st&raquo;, &laquo;2 s.&raquo;, &laquo;EPS&raquo;.
ru: Используйте короткие названия подгрупп, например &laquo;1-я&raquo;, &laquo;2 п.&raquo;, &laquo;EPS&raquo;.

source: There are no criteria defined.
ru: Критерии не определены.

source: No topics.
ru: Нет тем.

source: No subgroups.
ru: Нет подгрупп.

source: Wiki
ru: Вики

source: Validator
ru: Контролёр тестов

source: MB
ru: МБ

source: There are no pictures.
ru: Нет картинок.

source: %(seconds)s s
ru: %(seconds)s с

source: %(megabytes)s MB
ru: %(megabytes)s МБ

source: score
ru: очки

source: compiler is considered legacy
ru: компилятор считается устаревшим

source: Legacy?
ru: Устарел?

source: KB
ru: КБ

source: Checker Message
ru: Сообщение программы проверки

source: Time created
ru: Время создания

source: Algo
ru: Алгоритм

source: Enter lines in the format of “[username] [password]”.
ru: Введите строки в формате «[имя пользователя] [пароль]».

source: Create new folder
ru: Создать новую папку

# noun
source: Change password
ru: Изменение пароля

source: Bulk password change
ru: Массовое изменение паролей

source: %(count)d password has been changed.
ru: Изменён %(count)d пароль.
