Repository: BurAndBY/irun2-mirror
Catalog: project/locale/*/LC_MESSAGES/django.po
Languages: lt, ru

source: Start time
lt: Pradžios laikas

source: Duration
lt: Trukmė

source: Mark
lt: Pažymėti

source: Answers
lt: Atsakymai

source: Not permitted to view answers
lt: Negalima peržiūrėti atsakymų

source: Continue
lt: Tęsti

source: You can pass this quiz only once.
lt: Šią viktimą galite perduoti tik vieną kartą.

source: Turn off
lt: Išjunk

source: Turn on
lt: Įjungti

source: Sheet
lt: Lakštas
ru: Ведомость

source: Rating
lt: Reitingas

source: Start quiz
lt: Pradėti viktoriną

source: No quizzes
lt: Ne viktorinos

source: Quiz answers
lt: Viktorina atsakymai

source: Points
lt: Taškai

source: Correct
lt: Teisingas

source: Incorrect but chosen
lt: Neteisingas, bet pasirinktas

source: Correct but not chosen
lt: Teisingas, bet nepasirinktas

source: Delete session
lt: Ištrinti sesiją

source: Quiz session will be deleted
lt: Viktorina sesija bus ištrinta

source: No finished sessions
lt: Nėra baigtų seansų

source: Average mark
lt: Vidutinis ženklas

source: Result
lt: Rezultatas
ru: Итог

source: Attempts
lt: Mėginimai
ru: Попытки

source: Subgroups
lt: Pogrupiai
ru: Подгруппы

source: Edit common problems list
lt: Redaguokite bendrų problemų sąrašą
ru: Редактирование списка общих задач

source: Topics
lt: Temos
ru: Темы

source: Folder
lt: Aplankas
ru: Папка

source: %(counter)s problem
lt: %(counter)s problema
ru: %(counter)s задача

source: To assign
lt: Paskirti
ru: Для назначения

source: No topics
lt: Nėra temų

source: New topic
lt: Nauja tema
ru: Новая тема

source: These problems are not assigned individually. Every student can solve them.
lt: Šios problemos nėra skiriamos atskirai. Kiekvienas studentas gali juos išspręsti.
ru: Эти задачи не назначаются индивидуально. Их может решать каждый студент.

source: Delete the course
lt: Ištrinti kursą
ru: Удалить курс

source: Quiz template
lt: Viktorina šabloną

# quiz
source: Passed
lt: Išlaikė

source: %(counter)s time
lt: %(counter)s kartą

source: New quiz
lt: Nauja viktorina

source: Tag
lt: Žyma

# quiz
source: Available
lt: Galima

source: <strong>Warning!</strong> Sum of weights is %(sum_actual)s, but %(sum_expected)s is required.
lt: <strong>Įspėjimas!</strong> Svorių suma yra %(sum_actual)s, bet %(sum_expected)s yra privalomi.
ru: <strong>Внимание!</strong> Сумма весов равна %(sum_actual)s, хотя необходима сумма %(sum_expected)s.

source: Main kinds of activity
lt: Pagrindinės veiklos rūšys
ru: Основные зачётные виды деятельности

source: Extra kinds of activity
lt: Papildomos veiklos rūšys
ru: Дополнительные виды деятельности

source: New kind of activity
lt: Naujos rūšies veikla
ru: Новый вид деятельности

source: No subgroups
lt: Nėra pogrupių

source: New subgroup
lt: Naujas pogrupis
ru: Новая подгруппа

source: Subgroup
lt: Pogrupis
ru: Подгруппа

source: No users are set.
lt: Nė vienas vartotojas nenustatytas.
ru: Пользователи не заданы.

source: Edit students list
lt: Redaguoti studentų sąrašą
ru: Редактирование списка студентов

source: Edit teachers list
lt: Redaguoti mokytojų sąrašą
ru: Редактирование списка преподавателей

source: Edit mode is on.
lt: Redagavimo režimas įjungtas.
ru: Включён режим редактирования.

source: All changes are saved automatically.
lt: Visi pakeitimai išsaugomi automatiškai.
ru: Все изменения автоматически сохраняются.

source: Return to view mode (read-only).
lt: Grįžti į peržiūros režimą (tik skaitymui).
ru: Вернуться в режим просмотра (только чтение).

# course
source: Standings
lt: Lentelės
ru: Журнал

source: Plagiarism
lt: Plagiatas
ru: Плагиат

source: Individual problems
lt: Individualios problemos

source: Error while getting data from server.
lt: Klaida gaunant duomenis iš serverio.
ru: Ошибка получения данных с сервера.

source: Please select a problem.
lt: Pasirinkite problemą.
ru: Пожалуйста, выберите задачу.

source: %(year)d year
lt: %(year)d metai

source: Edit criterion
lt: Redaguoti kriterijų
ru: Редактировать критерий

source: You have %(count)d attempt remaining for the problem during the day.
lt: Jūs turite %(count)d bandymo likti problemai per dieną.
ru: Осталась %(count)d попытка по задаче в течение суток.

source: You have no attempts remaining for the problem.
lt: Jūs neturite bandymų likti problemos.
ru: Доступные попытки по задаче закончились.

source: Please try again after %(ts)s.
lt: Pabandykite dar kartą po %(ts) s.
ru: Попробуйте отправить решение после %(ts)s.

source: The number of attempts is not limited.
lt: Bandymų skaičius neribojamas.
ru: Число попыток не ограничено.

source: message body
lt: laiško kūnas
ru: тело сообщения

source: Confirmation required
lt: Patvirtinimas reikalingas
ru: Требуется подтверждение

source: Are you sure you want to delete the feedback message?
lt: Ar tikrai norite ištrinti atsiliepimo pranešimą?
ru: Вы уверены, что хотите удалить сообщение обратной связи?

source: Feedback Messages
lt: Atsiliepimų žinutės
ru: Сообщения обратной связи

source: Anonymous user
lt: Anonimas vartotojas
ru: Анонимный пользователь

source: Feedback Form
lt: Atsiliepimo forma
ru: Форма обратной связи

source: Thanks!
lt: Dėkojame!
ru: Спасибо!

source: Your message has been saved.
lt: Jūsų žinutė išsaugota.
ru: Ваше сообщение сохранено.

source: show on the main page
lt: rodyti pagrindiniame puslapyje
ru: показывать на главной странице

source: Add news
lt: Pridėti naujienų
ru: Добавить новость

source: Date
lt: Data
ru: Дата

source: Subject
lt: Temag
ru: Тема

source: Visibility
lt: Matomumas
ru: Видимость

source: Update news
lt: Atnaujinti naujienas
ru: Обновить новость

source: Time limit cannot be negative.
lt: Terminas negali būti neigiamas.
ru: Ограничение по времени не может быть отрицательным.

source: Time limit is too big (exceeds %(limit)s s).
lt: Laikas per didelis (viršija %(limit)s s).
ru: Ограничение по времени слишком большое (превышает %(limit)s с).

source: Time limit is too small.
lt: Laikas per mažas.
ru: Ограничение по времени слишком маленькое.

source: Time limit per test measured in seconds (i.e. 0.5 or 2).
lt: Bandymo trukmė, išmatuojama sekundėmis (ty 0,5 arba 2).
ru: Ограничение по времени на тест в секундах (например 0,5 или 2).

source: Memory limit cannot be negative.
lt: Atminties riba negali būti neigiama.
ru: Ограничение по памяти не может быть отрицательным.

source: Memory limit is too big (exceeds %(limit)s MB).
lt: Atminties riba yra per didelė (viršija %(limit)s MB).
ru: Ограничение по памяти слишком большое (превышает %(limit)s МБ).

source: Memory limit is too small.
lt: Atminties riba per maža.
ru: Ограничение по памяти слишком маленькое.

source: Memory limit per test measured in mebibytes (i.e. 64 or 256).
lt: Mėginio atminties riba, išmatuojama mebibituose (ty 64 arba 256).
ru: Ограничение по памяти на тест в мебибайтах (например 64 или 256).

source: Difficulty level on the ten-point scale (for courses).
lt: Sunkumo lygis dešimties balų skalėje (kursams).
ru: Уровень сложности по десятибалльной шкале (для учебных курсов).

source: Leave empty to use standard input.
lt: Palikite tuščią naudoti standartinį įvestį.
ru: Оставьте пустым, чтобы использовать стандартный ввод.

source: Leave empty to use standard output.
lt: Palikite tuščią naudoti standartinę išvestį.
ru: Оставьте пустым, чтобы использовать стандартный вывод.

source: Problem folders
lt: Problemų aplankai
ru: Папки с задачами

source: Time limit
lt: Terminas
ru: Ограничение по времени

source: Memory limit
lt: Atminties riba
ru: Ограничение по памяти

source: Full feedback will be available for the first <i>N</i> test cases.
lt: Visiems atsiliepimams bus pateikti pirmieji <i>N</i> testavimo atvejai.

source: A file with this name already exists.
lt: Failas su šiuo pavadinimu jau egzistuoja.
ru: Файл с таким именем уже существует.

source: ZIP-archive
lt: ZIP-archyvas
ru: ZIP-архив

source: The archive should not contain any other files except test inputs and outputs.
lt: Archyve neturėtų būti jokių kitų failų, išskyrus bandymo įėjimus ir išvestį.
ru: Архив не должен содержать других данных, кроме входных и выходных файлов тестов.

source: File naming scheme
lt: Failų pavadinimų schema
ru: Схема именования файлов

source: Archive format is not supported.
lt: Archyvo formatas nepalaikomas.
ru: Формат архива не поддерживается.

source: No test files found in the archive.
lt: Archyvuose nerasta bandomųjų failų.
ru: Тестовые файлы в архиве не найдены.

source: Russian
lt: Rusų kalba
ru: Русский

source: English
lt: Anglų kalba
ru: Английский

source: Full package (Windows) as a ZIP-archive
lt: Visas paketas (Windows) kaip ZIP-archyvas
ru: Полный пакет (Windows) в виде ZIP-архива

source: Problem statement language
lt: Problematikos kalba
ru: Язык условия задачи

source: Compiler for checker and validator
lt: Kompiliatorius tikrintojui ir validatoriui
ru: Компилятор для программы проверки и контролёра тестов

source: Unknown file found in the archive: %(name)s
lt: Nežinomas archyvo failas: %(name)s
ru: В архиве обнаружен неизвестный файл: %(name)s

source: File not found in the archive: %(name)s
lt: Failas nerastas archyve: %(name)s
ru: Файл не найден в архиве: %(name)s

source: number
lt: numeris
ru: номер

source: subnumber
lt: ponumeris
ru: подномер

source: full name
lt: pilnas vardas
ru: полное название

source: short name
lt: trumpas vardas
ru: короткое название

source: difficulty
lt: sunku
ru: сложность

source: input file name
lt: įvesties failo vardas
ru: имя входного файла

source: output file name
lt: išvesties failo vardas
ru: имя выходного файла

source: folders
lt: aplankai
ru: папки

source: A problem must have a number or a non-empty name.
lt: Problema turi turėti numerį arba ne tuščią pavadinimą.
ru: У задачи должен быть номер или непустое название.

source: hint
lt: užuomina
ru: подсказка

source: number of sample tests
lt: pavyzdžių bandymų skaičius

source: TeX statement
lt: TeX pareiškimas
ru: Условие в формате TeX

source: HTML statement
lt: HTML teiginys
ru: Условие в формате HTML

source: Additional statement file
lt: Papildomos ataskaitos failas
ru: Дополнительный файл условия

source: Sample input file
lt: Pavyzdinis įvesties failas
ru: Пример входного файла

source: Sample output file
lt: Pavyzdžio išvesties failas
ru: Пример выходного файла

source: User file
lt: Vartotojo failas
ru: Файл пользователя

source: file type
lt: failo tipas
ru: тип файла

source: Author's solution
lt: Autoriaus sprendimas
ru: Авторское решение

source: Checker
lt: Tikrintojas
ru: Программа проверки

source: Contestant solution
lt: Dalyvio sprendimas
ru: Решение участника

source: Generator
lt: Generatorius
ru: Генератор

source: Library
lt: Biblioteka
ru: Библиотека

source: compiler
lt: Kompiliatorius
ru: компилятор

source: Name
lt: Vardas
ru: Название

source: Folders
lt: Aplankai
ru: Папки

source: Tests
lt: Testai
ru: Тесты

source: Challenges
lt: Iššūkiai
ru: Взломы

source: Rejudges
lt: Perduoda
ru: Перетестирования

source: Files
lt: Failai
ru: Файлы

source: TeX editor
lt: TeX redaktorius
ru: Редактор TeX

source: Pictures
lt: Nuotraukos
ru: Картинки

source: Batch deteting
lt: Baterijos nustatymas

source: test
lt: testas
ru: тест

source: The tests are going to be deleted.
lt: Bandymai bus ištrinti.

source: Batch editing
lt: Serijinis redagavimas
ru: Массовое редактирование

source: Open
lt: Atidaryta
ru: Открыть

source: Download
lt: Parsisiųsti
ru: Загрузить

source: Input file
lt: Įvesties failas
ru: Входной файл

source: Output file
lt: Išvesties failas
ru: Выходной файл

source: No result got
lt: Rezultatas nebuvo
ru: Результат не получен

source: Add to test cases
lt: Įtraukti į testavimo atvejus
ru: Добавить к тестам

source: New challenge
lt: Naujas iššūkis
ru: Новый взлом

source: Start
lt: Pradėti
ru: Старт

# challenge
source: Created
lt: Sukūrta
ru: Создан

source: No challenges
lt: Jokių iššūkių
ru: Нет взломов

source: Unable to delete the problem because it is currently in use.
lt: Nepavyko ištrinti problemos, nes ji šiuo metu naudojama.
ru: Нельзя удалить задачу, потому что она в данный момент используется.

source: Delete the problem
lt: Ištrinkite problemą
ru: Удалить задачу

source: You should probably do not do this. Consider moving the problem to a special folder instead of permanently deleting it.
lt: Tikriausiai neturėtumėte tai daryti. Apsvarstykite galimybę perkelti problemą į specialų aplanką, o ne visam laikui ją ištrinti.
ru: Скорее всего, вам не следует делать этого. Рассмотрите вариант переноса задачи в специальную папку вместо того, чтобы удалять её совсем.

source: Are you sure you want to delete the file
lt: Ar tikrai norite ištrinti failą
ru: Вы уверены, что хотите удалить файл

source: Edit the test case
lt: Redaguokite testo pavyzdį
ru: Редактировать тест

source: New test case
lt: Naujas testas
ru: Новый тест

source: Answer file
lt: Atsakymo failas
ru: Файл правильного ответа

source: Data files
lt: Duomenų failai
ru: Файлы с данными

source: (statements, editorials, pictures)
lt: (pareiškimai, redakciniai straipsniai, nuotraukos)
ru: (условия, разборы, картинки)

source: Type
lt: Tipas
ru: Тип

source: New file
lt: Naujas failas
ru: Новый файл

source: Source files
lt: Šaltinio failai
ru: Файлы с кодом

source: (checkers, validators)
lt: (tikrintuvai, validatoriai)
ru: (программы проверки, контролёры тестов)

source: Compiler
lt: Kompiliatorius
ru: Компилятор

source: A problem may be put into several folders. Use <kbd>Ctrl</kbd> key to select multiple options.
lt: Problema gali būti pateikta keliuose aplankuose. Naudokite klavišą <kbd>Ctrl</kbd>, norėdami pasirinkti keletą parinkčių.
ru: Задача может располагаться в нескольких папках. Используйте клавишу <kbd>Ctrl</kbd> для выбора папок.

source: Input file name
lt: Įvesties failo vardas
ru: Имя входного файла

source: Output file name
lt: Išvesties failo pavadinimas
ru: Имя выходного файла

source: Level
lt: Lygis
ru: Уровень

source: Short name
lt: Trumpas vardas
ru: Короткое название

source: There is no statement for this problem
lt: Nėra šios problemos teiginio
ru: В системе нет условия для этой задачи

source: Use F2 key to switch view
lt: Norėdami perjungti rodinį, naudokite F2 klavišą
ru: Используйте клавишу F2 для переключения вида

source: one example
lt: vienas pavyzdys
ru: один пример

source: two examples
lt: du pavyzdžiai
ru: два примера

source: three examples
lt: trys pavyzdžiai
ru: три примера

source: Loading...
lt: Kraunasi...
ru: Загрузка...

source: Search
lt: Leškoti
ru: Поиск

source: New problem
lt: Nauja problema
ru: Новая задача

source: Import from Polygon
lt: Importuoti iš Polygon
ru: Импорт из Polygon

source: Delete folder
lt: Ištrinti aplanką
ru: Удалить папку

source: The folder or its subfolders are currently used in the following courses and cannot be deleted.
lt: Aplankas ar jo poaplankiai šiuo metu naudojami šiuose kursuose ir jų negalima ištrinti.
ru: Папка или её подпапки в настоящий момент используются в следующих курсах и не могут быть удалены.

source: The folder is going to be deleted together with its subfolders. The problems they contain will not be deleted.
lt: Šis aplankas bus ištrintas kartu su jo poaplankiais. Jų problemos nebus ištrintos.
ru: Папка будет удалена вместе с подпапками. Задачи, которые в них содержатся, не будут удалены.

source: inside ‘%(nn)s’
lt: viduje „%(nn)s“
ru: в папке «%(nn)s»

source: in the root folder
lt: Šakniniame aplanke
ru: в корневой папке

source: Import error
lt: Importuoti klaidą
ru: Ошибка импорта

source: Import a problem from Polygon
lt: Importuokite problemą iš Polygon
ru: Импортировать задачу из Polygon

source: Import
lt: Importas
ru: Импорт

source: Problem search
lt: Problemų paieška
ru: Поиск задач

source: Search for...
lt: Leškoti...
ru: Искать...

source: Main properties
lt: Pagrindinės savybės
ru: Основные свойства

source: Number
lt: Skaičius
ru: Номер

source: Full name
lt: Pilnas vardas
ru: Полное название

source: Difficulty level
lt: Sunkumo lygis
ru: Уровень сложности

source: Input
lt: Sąnaudos
ru: Вход

source: Output
lt: Išvestis
ru: Выход

source: Default time limit
lt: Numatytasis terminas
ru: Ограничение по времени по умолчанию

source: Default memory limit
lt: Numatytoji atminties riba
ru: Ограничение по памяти по умолчанию

source: Hint
lt: Patarimas
ru: Подсказка

source: file
lt: failas
ru: файл

source: No pictures
lt: Nėra nuotraukų

source: Image
lt: Vaizdas
ru: Изображение

source: Open in new tab
lt: Atidaryti naujame skirtuke
ru: Открыть в новой вкладке

# rejudge
source: Created
lt: Sukūrta

source: No rejudges
lt: Nieko nėra teisėjų

source: Test
lt: Testas
ru: Тест

# test
source: Created
lt: Sukūrta
ru: Создан

source: Test case is going to be deleted.
lt: Testavimo atvejis bus ištrintas.
ru: Тест будет удалён.

source: Bulk operations
lt: Masinės operacijos
ru: Массовые операции

source: Rejudge all solutions
lt: Pataisykite visus sprendimus
ru: Перетестировать все решения

source: Rejudge accepted solutions
lt: Pataisykite priimtus sprendimus
ru: Перетестировать принятые решения

source: Submission time
lt: Paraiškos pateikimo laikas
ru: Время отправления

# verb
source: Rejudge
lt: Pakartokite
ru: Перетестировать

source: Download archive
lt: Atsisiųsti archyvą
ru: Загрузить архив

source: Check two solutions to compare.
lt: Patikrinkite du lyginamuosius sprendimus.
ru: Отметьте два решения для сравнения.

source: Compare solutions
lt: Palyginkite sprendimus
ru: Сравнить решения

source: Print version
lt: Spausdinti

source: An error occurred while running validator
lt: Paleidus validatorį įvyko klaida
ru: Во время выполнения контролёра тестов произошла ошибка

source: All test input files have passed the validation.
lt: Visi bandymo įvesties failai išlaikė patvirtinimą.
ru: Все входные файлы тестов прошли контроль.

source: Some test input files have not passed the validation.
lt: Kai kurie bandymo įvesties failai nepatvirtino patvirtinimo.
ru: Некоторые входные файлы тестов не прошли контроль.

source: Validation is running&hellip; Refresh the page after a while to see results.
lt: Patvirtinimas vyksta & hellip; Po kurio laiko atnaujinkite puslapį, kad pamatytumėte rezultatus.
ru: Идёт контроль тестов&hellip; Обновите страницу через некоторое время, чтобы увидеть результаты.

source: New tests from archive
lt: Nauji bandymai iš archyvo
ru: Новые тесты из архива

source: Browse
lt: Naršyti
ru: Обзор

source: Actions
lt: Papildomi veiksmai
ru: Действия

source: Set time limit
lt: Nustatykite laiko ribą
ru: Задать ограничение по времени

source: Set memory limit
lt: Nustatykite atminties ribą
ru: Задать ограничение по памяти

source: Set points
lt: Nustatyti taškai

source: No tests
lt: Ne bandymų
ru: Нет тестов

source: Sample test
lt: Bandinio pavyzdys

source: New statement
lt: Naujas pareiškimas
ru: Новое условие

source: New editorial
lt: Naujas redakcinis straipsnis
ru: Новый разбор

source: The same settings will be used for each uploaded test case.
lt: Tie patys nustatymai bus naudojami kiekvienai įkeltai bandymo bylai.
ru: Для каждого загруженного теста будут использованы одинаковые настройки.

source: Upload
lt: Įkelti
ru: Загрузить

source: Revalidate testset
lt: Patikrinkite bandymų rinkinį
ru: Выполнить контроль набора тестов

source: from %(from)s to %(to)s
lt: nuo %(from)s iki %(to)s
ru: от %(from)s до %(to)s

source: Test %(no)d has been added.
lt: Testas %(no)d buvo pridėtas.
ru: Добавлен тест %(no)d.

source: points
lt: taškai

source: time limit
lt: laiko riba
ru: ограничение по времени

source: memory limit
lt: atminties riba
ru: ограничение по памяти

source: input file
lt: įvesties failas
ru: входной файл

source: answer file
lt: atsakymas failas
ru: файл правильного ответа

source: Test %(number)s has been saved.
lt: Testas%(number)s išsaugotas.
ru: Тест %(number)s сохранён.

source: Changes:
lt: Pakeitimai:
ru: Изменения:

source: %(count)d test has been added.
lt: %(count)d testas buvo pridėtas.
ru: Добавлен %(count)d тест.

source: Create folder
lt: Sukurti aplanką
ru: Создать папку

source: Folder properties
lt: Aplanko savybės
ru: Свойства папки

source: Unknown
lt: Nežinoma
ru: Неизвестно

source: string identifier
lt: eilutės identifikatorius
ru: строковый идентификатор

source: language
lt: kalba
ru: язык

source: compiler is enabled by default in new courses
lt: kompiuteris yra įjungtas pagal numatytuosius nustatymus naujuose kursuose

source: compiler is enabled by default in new contests
lt: kompiuteris yra įjungtas pagal nutylėjimą naujose varžybose

source: compile command
lt: sudaryti komandą
ru: команда компиляции

source: run command
lt: paleisti komandą
ru: команда запуска

source: New compiler
lt: Naujas kompiliatorius
ru: Новый компилятор

source: String identifier
lt: Styginių identifikatorius
ru: Строковый идентификатор

source: Language
lt: Kalba
ru: Язык

source: For courses?
lt: Kursams?

source: For contests?
lt: Konkursams?

source: Compile command line
lt: Kompiliavimo komandų eilutė
ru: Командная строка компиляции

source: Run command line
lt: Paleisti komandinę eilutę
ru: Командная строка запуска

source: Single correct answer
lt: Vienintelis teisingas atsakymas

source: Multiple correct answers
lt: Keletas teisingų atsakymų

source: Text answer
lt: Teksto atsakymas

source: shuffle questions
lt: maišyti klausimus

source: attempts
lt: bandymai

source: group
lt: grupė

source: quiz template
lt: viktorinos šablonas

source: course
lt: kursas

source: is available
lt: yra prieinama

source: tag
lt: žymelė

source: show answers
lt: parodyti atsakymus

source: Question groups
lt: klausimų grupės

source: Quiz templates
lt: viktorinos šablonai

source: No answer
lt: Nėra atsakymo

source: Question count
lt: Klausimų skaičius

source: No question groups
lt: Nėra klausimų grupių

source: Question group
lt: Klausimų grupė

source: Shuffle questions
lt: Maišyti klausimus

source: Unlimited
lt: Neribotas

source: Add question group
lt: Pridėti klausimų grupę

source: New template
lt: Naujas šablonas

source: Sessions
lt: Sesijos

source: No quiz templates
lt: Ne viktorinos šablonai

source: Course
lt: Kursas
ru: Курс

source: Finish
lt: Baigti

source: No
lt: Neh

source: Error
lt: Klaida

source: Next
lt: Kitas

source: Previous
lt: Ankstesnis

source: Network error
lt: Tinklo klaida

source: No time left
lt: Nebuvo laiko

source: not found
lt: nerastas
ru: не найдено

source: access denied
lt: prieiga atmesta
ru: доступ запрещён

source: no data
lt: nėra duomenų
ru: нет данных

source: the file is binary
lt: failas yra dvejetainis
ru: файл бинарный

source: the file is too big
lt: failas yra per didelis
ru: файл слишком большой

source: unknown error
lt: nežinoma klaida
ru: неизвестная ошибка

source: Enter source code
lt: Įveskite šaltinio kodą
ru: Введите исходный код

source: …or upload a file
lt: ...arba įkelkite failą
ru: …или загрузите файл

source: If you select a file, text field content is ignored.
lt: Jei pasirinksite failą, teksto lauko turinys bus ignoruojamas.
ru: Если вы выбираете файл, содержимое текстового поля игнорируется.

source: The size of the source file (%(actual)d B) exceeds the limit (%(limit)d B).
lt: Šaltinio failo dydis (%(actual)d B) viršija ribą (%(limit)d B).
ru: Размер исходного файла (%(actual)d Б) превышает установленное ограничение (%(limit)d Б).

source: Unable to submit an empty solution.
lt: Nepavyksta pateikti tuščio sprendimo.
ru: Нельзя отправить пустое решение.
